000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РаспределениеПродаж/РаспределениеПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаспределениеПродаж</name>
  <resources>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РаспределениеПродаж/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Процедура записывает данные в регистр
//
// Параметры
//	ТаблицаРегистра	- Таблица значений, структура = структура регистра
//
// Возвращаемое значение
//	Нет
//
Процедура ЗаписатьДанныеВРегистр(ТаблицаРегистра) Экспорт
	
	Если ТаблицаРегистра.Количество() > 0 Тогда
		
		НаборЗаписей = РегистрыСведений.РаспределениеПродаж.СоздатьНаборЗаписей();
		КоличествоСтрок = ТаблицаРегистра.Количество()-1;
		
		Для Инд = 0 По КоличествоСтрок Цикл
			
			СтрокаТаблицыРегистра = ТаблицаРегистра[КоличествоСтрок - Инд];
			
			Если СтрокаТаблицыРегистра.Очистить Тогда
				
				НаборЗаписей.Отбор.Магазин.Установить(СтрокаТаблицыРегистра.Магазин);
				НаборЗаписей.Отбор.НоменклатурнаяГруппа.Установить(СтрокаТаблицыРегистра.НоменклатурнаяГруппа);
				НаборЗаписей.Отбор.РабочееМесто.Установить(СтрокаТаблицыРегистра.РабочееМесто);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				НаборЗаписей.Записать(Истина);
				ТаблицаРегистра.Удалить(СтрокаТаблицыРегистра);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаТаблицыРегистра ИЗ ТаблицаРегистра Цикл
			
			НаборЗаписей.Отбор.Магазин.Установить(СтрокаТаблицыРегистра.Магазин);
			НаборЗаписей.Отбор.НоменклатурнаяГруппа.Установить(СтрокаТаблицыРегистра.НоменклатурнаяГруппа);
			НаборЗаписей.Отбор.РабочееМесто.Установить(СтрокаТаблицыРегистра.РабочееМесто);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтрокаТаблицыРегистра);
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.РаспределениеПродаж.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записать();
		
	КонецЕсли;

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
